app/Views/dashboard/desa.php

$request = \Config\Services::request();
$segment = $request->uri->getSegment(1);

$resUser = $user->find(session()->get('id_user'));
---
SELECT *
FROM `tb_user`
WHERE `tb_user`.`id_user` = '5'