app/Views/dashboard/index.php

SELECT count(id_barang) as count
FROM `tb_barang`
WHERE `id_kategori` = '1'
 LIMIT 1
---
                                        <td><?= $d['nama_kategori']; ?></td>
                                        <?php
                                        $modelbarang = new \App\Models\BarangModel();
                                        $countData = $modelbarang->select('count(id_barang) as count')->where('id_kategori', $d['id_kategori'])->first()['count'];