app/Views/template/sidebar.php

$segment = $request->uri->getSegment(1);
$segment2 = $request->uri->getSegment(2);

$resUser = $user->join('tb_role', 'tb_role.id_role = tb_user.id_role')->find(session()->get('id_user'));
---
SELECT *
FROM `tb_user`
JOIN `tb_role` ON `tb_role`.`id_role` = `tb_user`.`id_role`
WHERE `tb_user`.`id_user` = '1'