app/Controllers/Dashboard.php

SELECT *
FROM `tb_barang`
SELECT COUNT(id_pengeluaran) as count
FROM `tb_pengeluaran`
 LIMIT 1
SELECT COUNT(id_penerimaan) as count
FROM `tb_penerimaan`
 LIMIT 1
SELECT *
FROM `tb_kategori`
---
    public function index()
    {

        $data = [
            'title' => 'Dashboard'
        ];

        if (session()->get('id_role') == 5) {
            $chart = "( SELECT COUNT(id_pengajuan) AS COUNT FROM tb_pengajuan_barang WHERE id_pengajuan = tb_pengajuan_barang.id_pengajuan) AS count";
            $data['charts'] = $this->modelpengajuan->select('*')->groupBy('id_status_pengajuan')->select($chart)->findAll();

            $data['pengajuan_pending'] = $this->modelpengajuan->select('COUNT(id_pengajuan) AS count')->where('id_status_pengajuan', 1)->first()['count'];
            $data['pengajuan_done'] = $this->modelpengajuan->select('COUNT(id_pengajuan) AS count')->where('id_status_pengajuan', 2)->first()['count'];

            return view('dashboard/desa', $data);
        } else {

            $sub_chart = "( SELECT COUNT(id_barang) AS COUNT FROM tb_barang WHERE id_barang = tb_barang.id_barang) AS count";
            $data['chart'] = $this->modelbarang->select('nama_barang')->select('stok')->select($sub_chart)->findAll();
            $data['count_barang'] = count($this->modelbarang->findAll());
            $data['count_pengeluaran'] = $this->modelpengeluaran->select('COUNT(id_pengeluaran) as count')->first()['count'];
            $data['count_penerimaan'] = $this->modelpenerimaan->select('COUNT(id_penerimaan) as count')->first()['count'];
            $data['kategori'] = $this->modelkategorilogistik->findAll();