app/Controllers/PengajuanBarang.php

SELECT *
FROM `tb_pengajuan_barang`
JOIN `tb_status_pengajuan` ON `tb_pengajuan_barang`.`id_status_pengajuan` = `tb_status_pengajuan`.`id_status_pengajuan`
---
    public function index()
    {
        $pengajuan = $this->modelpengajuan->select('*')->join('tb_status_pengajuan', 'tb_pengajuan_barang.id_status_pengajuan = tb_status_pengajuan.id_status_pengajuan')->findAll();