app/Models/UserModel.php

    public function cekLogin($username)
    {
        $builder  = $this->db->table($this->table);
        $builder->where('username', $username);

        // SELECT * FROM tb_user WHERE username = username OR npm = username OR email = username
        return $builder->get()->getResultArray();
---
SELECT *
FROM `tb_user`
WHERE `username` = 'staff'